docs: replace plantuml with mermaid diagrams
